Repository: 84000/translation-memory-resources
Catalog: post_input/toh287-C.bo.en.tmx
Source language: bo
Languages: en

source: དེ་ འཕེན་པ་ ན་ ལྷ་ ལག་ ན་ཡོལ་ གོ་ ཐོགས་པ་ རྣམས་ ཀྱིས་ ཆོས་རྗེས་ སུ་ དྲན་པ ར་ བྱས །_
en: The gods, however, will recollect the Dharma and take refuge in the Three Jewels.

source: དཀོན་མཆོག་ གསུམ་ ལ་ སྐྱབས་ སུ་ སོང་ ནས །_ མད འི་ རྒྱུན་ རྣམས་ ཀྱིས་ རི་ དེ་དག་ རྒྱ་མཚོ འི་ དབུས་ དེར་ བྱེ་མ་ ཆང་པ་ ནས་ གཏོར་བ་ བཞིན་ དུ་ གཏོར་ ཏོ །_།
en: Thus, the stream of their arrows will pulverize the mountains that came from the center of the sea as if they were handfuls of sand.

source: མེ་ཏོག་ ཕྲེང་ དེས་ ལས་ ཀྱི་ འབྲས་བུ་ དེ་དག་ མེད་པར་ མངོན་པར་ མཐོང་ ནས་ ལག་ ན་ དབྱུག་ ཏོ་ ཐོགས་ ཏེ །_ ལྷ་ ལག་ ན་ཡོལ་ གོ་ ཐོགས་པ་ ག་ལ་བ་ དེ འི་ མདུན་ ཉིད་ དུ་ འདུག་ གོ །_།
en: When, as a karmic effect, Puṣpamāla sees the mountains reduced to nothing, he will instead take up a staff and stand before the vessel-bearer gods.

source: དེ་དག་ འཁོར་ དང་ བཅས །_ དཔུང་ དང་ །_ མཐུ་ དང་ བཅས་པ་ འོང་བ་ མངོན་པར་ མཐོང་ ནས་ ཆར་ གནམ་ལྕགས་ ལྟ་བུ འི་ མཐུ་ ཡིས་ དབྱུག་ ཏོ་ དེ་ གཅོད་པ ར་ བྱེད་ ཅིང་ །_ ལྷ་མ་ ཡིན་ དེ་དག་ ཉམས་ སྨད་ དེ་དེ་ ལྟར་ དེ་དག་ ཕམ་པ ར་ བྱས་ སོ །_།
en: But when the gods see him approaching with his retinue, army, and forces, they will cut his staff to pieces with a power that is like a meteoric rain. Thus, they will humble and defeat the asuras.

source: ལྷ་མ་ ཡིན་ གྱི་ དབང་པོ་ བརྟན་པ་ ཡང་ ལྷ་ རྟག་ ཏུ་ མྱོས་ གནས་ ག་ལ་བ་ དེར་ གཡུལ་འགྱེད་པ འི་ ཕྱིར་ མཚོན་ཆ་ ཀུན་འཇོམས་ དཔག་ཚད་ ཙམ་ བླངས་ ནས་ འདོང་བ ར་ བྱེད་ དོ །_།
en: $277 “Meanwhile, the asura ruler Firm will go to wage war in the realm of the ever-infatuated gods, carrying with him an all-destroying weapon that is one league long.

source: དེ་ནས་ ལྷ་མ་ ཡིན་ གྱི་ རྒྱལ་པོས་ ལྷ་ དེ་དག་ ལ་ འདི་སྐད་ སྨྲས་ སོ །_། འདི་ལྟར་ དེ་རིང་ བདག་ གིས་ ཐམས་ཅད་ ལས་ རྒྱལ་བ ར་ བྱ་ སྟེ །_
en: As he approaches with much noise, the asura king will shout to the gods of that realm,

source: ཐམས་ཅད་ མཚོན་ཆ་ ཀུན་འཇོམས་ གྱིས་ གཤིན་རྗེ འི་ གནས་ ག་ལ་བ་ དེར་ ཉེ་བ ར་ བཀྱེའོ་ ཞེས་ དེ་སྐད་ སྒྲ་ བསྒྲགས་ ནས་ ལྷ་ རྟག་ ཏུ་ མྱོས་ གནས་ རྣམས་ ག་ལ་བ་ དེར་ འདོང་བ ར་ བྱེད་ དོ །_།
en: ‘Today I shall defeat everyone! With this all-destroying weapon, I shall dispatch you to the realm of the Lord of Death!’

source: འཇིག་རྟེན་ སྐྱོང་བ་ རྣམས་ ཀྱིས་ [38a] དེ་ འོང་བ་ མངོན་པར་ མཐོང་ ནས་ ལག་ སྟོབས་ ཀྱིས་ མཚོན་ཆ་ ཕྲོགས་ ཏེ །_ ལྷ་མ་ ཡིན་ དེ་ཉིད་ ཀྱི་ བྲང་ དུ་ བརྒྱབ་བོ །།_།།
en: $278 “However, as the guardians of the world [38.a] see him approaching, they will grab his weapon and strike his own chest with it.

source: དེ་ མཚོན་ཆ་ དེས་ བརྒྱབ་པ་ དང་ ཉམས་ ནས་ ས འི་ འོག་ ག་ལ་བ་ དེར་ འགྲོ་བ ར་ བྱེད་ དོ །_།
en: Struck by his own weapon, his power will wane, and he will retreat below the earth.

source: དེ འི་ འཁོར་ལྷ་ མ་ ཡིན་ མགུལ་ ཕྲེང་ རྣམས་ ཀྱིས་ གང་ གིས་ ཉམས་པ་ མངོན་པར་ མཐོང་ ནས །_ ཉམས་པ་ སྲོག་ གི་ ལྷག་མ་ ལུས་པ་ དེ་དག་ ཐམས་ཅད་ ཀྱང་ ས འི་ འོག་ ག་ལ་བ་ དེར་ རྒྱུག་པ ར་ བྱེད་ དོ །_།
en: When the necklace asuras witness his defeat, all those still alive will likewise flee below the ground.

source: ལྷ་མ་ ཡིན་ གྱི་ དབང་པོ་ སྒྲ་གཅན་ ཡང་ འཁོར་ དང་ བཅས་ ཏེ །_ ལྷ་ པི་ བང་ ཅན་ གསུམ་པ་ ག་ལ་ བ་ དེར་ འདོང་བ ར་ བྱེད་ དོ །_།
en: $279 “The asura ruler Rāhu and his retinue will then advance on the realm of the triple-lute-bearer gods.

source: རང་ གི་ ལག་མཐུ ས་ དྲེགས་པ་ དེ་དག་ འོངས་པ་ མངོན་པར་ མཐོང་ ནས་ ལྷ་ རྣམས་ མེ་ཆར་ ལྟར་ མངོན་པར་ འབེབས་ ཤིང་ །_ དེ་དག་ ཀྱང་ ལྷ་མ་ ཡིན་ གྱི་ དབང་པོ་ སྒྲ་གཅན་ ག་ལ་བ་ དེར་ རྒྱུག་པ ར་ བྱེད་ དོ །_།
en: When the gods see the haughty asuras approaching, they will apply all their strength to bring down a rain of fire upon the asuras and will then rush forth to take on the asura ruler Rāhu.

source: མེ་ཆར་ ལྟར་ ཕབ་པ་ དེས་ ཀུན་ དུ་ མངོན་པར་ སྲེག་པ་ ན་ འཁོར་ དང་ བཅས་པ ར་ ས འི་ འོག་ ག་ལ་བ་ དེ་ཉིད་ དུ་ རྒྱུག་པ ར་ བྱེད་ དོ །_།
en: Scorched by the rain of fire, the asuras will run to take cover beneath the earth.

source: ལྷ་མ་ ཡིན་ གྱི་ དབང་པོ་ གསུམ་པོ་ དེ་དག་ མཐོང་ ནས་ ལྷ་ རྣམས་ ནི་ སྙིང་ རབ་ཏུ་ དགའ་བ ར་ གྱུར །_
en: $280 “When they witness the three asura rulers losing in this way, the gods will be utterly delighted.

source: ལྷ་མ་ ཡིན་ རྣམས་ ནི་ ཡིད་ དམན་པ ར་ གྱུར་ ཏེ །_ མཐུ་རྩལ་ ཉམས་པ །_ མགོན་ འདོད་པ །_ སྐྱབས་ འདོད་པ །_ དཔུང་གཉེན་ འདོད་པ་ ཐམས་ཅད་ ས འི་ འོག་ གི་ སྒོ་ ག་ལ་བ་ དེར་ རྒྱུག་པ ར་ བྱེད་ དོ །_།
en: All the asuras will feel inferior and, with their strength depleted, they will rush to the tunnels that lead below the earth, yearning for a protector, savior, and guardian.

source: དེ་དག་ གང་ གི་ ཚེ་ ས འི་ འོག་ གི་ སྒོ་ དེར་ ལྷགས་པ་ དེ འི་ ཚེ །_ ལྷ་ རྣམས་ ཡང་ བཻ་ ཌཱུརྱའི་ རི འི་ རྩེ་མོ་ དེ་ཉིད་ ལ་ འཛེགས་ ཏེ་ འཁོད་ དོ །_།
en: As the asuras enter the tunnels to the subterranean world, the gods will climb to the summit of the beryl mountain and take up positions there. They will say to one another,

source: འདི་ལྟར་ ལྷ་མ་ ཡིན་ རྣམས་ གོར་མ་ཆག་ པར་ ཡང་ འོང་བ ར་ འགྱུར་ ཏེ །_ གང་ གི་ ཕྱིར་ ཐགས་ བཟངས་ རིས་ དང་ རབ་དགོད་ དག་ ད་དུང་ དུ་མ་ འོངས་ ཏེ །_
en: ‘The asuras will no doubt return, because Vemacitrin and Overjoyed have not yet come.

source: ལྷ་མ་ ཡིན་ དེ་དག་ ནི་ དེ་ ལ་ སྲོག་ ལྟོས །_ དེ་ ལ་ རྟེན །_ དེ་ གཙོ་བོ ར་ བྱེད་པ་ ཡིན་ ནོ །_།
en: The life force of the asuras depends on them, the asuras rely on them, and they are their leaders.

source: དེ་ལས་ རྒྱལ་བ་ ནི །_ ཐམས་ཅད་ ལས་ རྒྱལ་བ ར་ འགྱུར་ ལ །_ དེ་ལས་ ཕམ་ ན་ ནི་ འདི་དག་ ཐམས་ཅད་ ལས་ ཕམ་པ ར་ འགྱུར་ རོ་
en: Defeating them means defeating them all; losing to them means losing to them all.’

source: ཞེས་ དེ་སྐད་ སྨྲས་ ནས །_ ལྷ་ ཐམས་ཅད་ དགའ་བ་ ཤིན་ཏུ་ སྐྱེས །_ མཐུ་ ཤིན་ཏུ་ སྐྱེས་ ཏེ །_ དེ་སྐད་ བརྗོད་ ཅིང་ གཡུལ་འགྱེད་པ འི་ ཕྱིར་ ངེས་པ ར་ གནས་པ ར་ བྱེད་ དོ །_།
en: Saying this to one another, the gods will feel utterly elated and invigorated. Thus, they will rest, prepared for battle.

source: ཀླུ འི་ རྒྱལ་པོ་ རབ་ འཇོམས་ ལ་སོགས་པ་ ཡང་ ལོངས་སྤྱོད་ ལྡན་ གྱི་ གྲོང་ཁྱེར་ ག་ལ་བ་ དེ་ ན་ ཀླུ འི་ རྒྱལ་པོ་ ནོར་ [38b] རྒྱས་ ཀྱི་ བུ་ དང་ །_ འཇོག་པོ་ ལ་སོགས་ པས་ དཔུང་ གི་ མཐུ་རྩལ་ ལྷག་མ་ ལུས་པ་ རྣམས་ བཅོམ་ མོ །_།
en: $281 “At this time the nāga kings Takṣaka, Vāsuki, and so on will also have wiped out [38.b] the military might of Pramatha and other such nāga kings in the city Endowed with Enjoyments.

source: དེ་དག་ ཀྱང་ རབ་དགོད་ དེ་ ལ་ ཤིན་ཏུ་ སེམས་ ཤིང་ དེ འི་ ཚེ་ དེ་ ལ་ དཔུང་ ཚོལ་ ཏེ །_
en: Their defeat will weigh strongly on the mind of Overjoyed, and so he will think,

source: དེས་ ལྷ་ རྣམས་ གཞོམ་པ ར་ ནུས་ ཀྱི །_ གཞན་ དུ་ ན་ ལྷ་མ་ ཡིན་ གྱི་ ཕྱོགས་ ནི་ ཤིན་ཏུ་ ཕམ་ ལ །_ ལྷ འི་ ཕྱོགས་ ནི་ རབ་ཏུ་ འཕེལ་ ཏོ་ སྙམ་ མོ །_།
en: ‘I must raise an army that can defeat the gods. Otherwise, the forces of the asuras will have been completely defeated, and the forces of the gods will have prevailed.’

source: དེ་ལྟ ར་ ལྷ་མ་ ཡིན་ གྱི་ ཕྱོགས་ ཀླུ་ དང་ ལྷ་མ་ ཡིན་ དེ་དག་ ཐམས་ཅད་ ཡིད་ སྡུག་བསྔལ་ ཞིང་ གནས་ སོ །_།
en: $282 “In this way, the nāgas that are allied with the asuras, and the asuras themselves, all suffer mental anguish and remain despondent.

source: དེ་ལྟ ར་ དེ་དག་ གནས་ ཤིང་ ལྷ་མ་ ཡིན་ རྣམས་ ཀྱང་ ཡིད་ དམན་པ ར་ གནས་ ཏེ །_ ཐགས་ བཟངས་ རིས་ དང་ །_ རབ་དགོད་ དག་ གིས་ འདི་ལྟར་ ལྷ་མ་ ཡིན་ གནས་ གསུམ་པ་ ན་ གནས་པ་ མེ་ཏོག་ ཕྲེང་ དང་ །_ བརྟན་པ་ དང་ །_ སྒྲ་གཅན་ ཡང་ ཕམ་པ ར་ གྱུར་ ཏོ་ ཞེས་ ཐོས་ ཏེ དེ་ལྟ ར་ མཐུ་ མེད་པར་ བྱས་ སོ །_། དེ་ལྟ ར་ སྤྲོ་བ་ མེད་པ །_ དཔུང་ དང་ མཐུ་ ཉམས་པ་ དེ་དག་ ལ་ མགོན་ གཞན་ མེད་ དེ །_ འདི་ལྟར་ ལྷ་མ་ ཡིན་ གྱི་ དབང་པོ་ ཁྱོད་ དུ་བ ས་ སོ །_།
en: Vemacitrin and Overjoyed will receive news that the asuras of the three realms of Puṣpamāla, Firm, and Rāhu have all suffered defeat. They will hear that the asuras have been rendered powerless and joyless. They will be told that, as their military strength has been broken, the asuras now have no other refuge besides them.

source: དེ་ནས་ ལྷ་མ་ ཡིན་ གྱི་ དབང་པོ་ རབ་དགོད་ ཀྱིས་ འདི་སྐད་ སྨྲས་ སོ །_།
en: The asura ruler Overjoyed will at that point command,

source: ལྷ་མ་ ཡིན་ རྣམས་ ལྷ་མ་ ཡིན་ གྱི་ དབང་པོ་ གསུམ་ དག་ ག་ལ་ གནས་ རྟོགས་ ཤིག་ རྟོགས་ ཤིག _།
en: ‘Go and find out where those three asura rulers are! Go and find out!’

source: དེ་སྐད་ སྨྲས་པ་ དང་ །_ ལྷ་མ་ ཡིན་ རྣམས་ ཀྱིས་ ལྷ་མ་ ཡིན་ གྱི་ དབང་པོ་ དེ་ ལ་ འདི་སྐད་ སྨྲས་ སོ །_།
en: $283 “The asuras will then bring this reply to him:

source: འདི་ལྟར་ ས འི་ འོག་ གི་ སྒོ འི་ ཐ་མ་ ན་ ལྷ་མ་ ཡིན་ དཔུང་ དང་ མཐུ་ ཉམས་པ་ ཐམས་ཅད་ ཁྱོད་ ལ་ སྲོག་ ལྟོས །_ ཁྱོད་ ལ་ དཔུང་ ཚོལ །_ ཁྱོད་ ལ་ རྟེན་ ཅིང་ མཆིས་ ཏེ །_
en: ‘They are hiding in the deepest tunnels to the subterranean world. With their armies and strength broken, they entrust their lives to you. They look to you for strength and depend on you.

source: མཚར་ ཁོ་ན ར་ ངོ་ཚ་ ནས་ ས འི་ འོག་ གི་ ནང་ དུ་ ཡང་ མཆི་བ འི་ རྔོ་ མ་ ཐོགས་ སོ །_།
en: Bewildered and embarrassed, they now remain incapacitated below the ground.’

source: དེ་ནས་ ཐགས་ བཟངས་ རིས་ དང་ རབ་དགོད་ ཀྱིས་ འདི་སྐད་ སྨྲས་ སོ །_།
en: $284 “At that point Vemacitrin and Overjoyed will ask,

source: ཅི་ ལྷ་ དེ་ རྣམས་ ཀྱི་ བརྒྱ་བྱིན་ འོངས་ སམ་ མ་འོངས །_
en: ‘Has the god Śakra come?’

source: ལྷ་མ་ ཡིན་ རྣམས་ ཀྱིས་ སྨྲས་པ །_ མ་ མཆིས་ སོ །_།
en: “ ‘No, he has not,’ the asuras will reply.

source: དེ་ནས་ རབ་དགོད་ ཁྲོས་པ འི་ མིག་དམ ར་པོ ས་ རང་ གི་ དཔུང་ ལ་ ལྟ་ ཞིང་ འདི་སྐད་ སྨྲས་ སོ །_།
en: $285 “With furious red eyes, Overjoyed will then look at his army and say,

source: རྒྱལ་ཆེན་ བཞི་པ་ དག་ ཉི་ཚེ ས་ གནས་ གསུམ་ དུ་ གཏོགས་པ འི་ ལྷ་མ་ ཡིན་ རྣམས་ ཕམ་པ ར་ བྱས །_
en: ‘The gods of the Four Great Kings have defeated the asuras in the regions of three levels!

source: དཔུང་ དང་ མཐུ་ ཉམས་པ ར་ བྱས །_ བརྩོན་པ་ མེད་པར་ བྱས་ ཏེ །_
en: They have broken their military strength and taken the wind out of their sails.

source: ཀྱེ་མ་ ལྷ་མ་ ཡིན་ རྣམས་ ལྷ འི་ རིས་ ཉི་ཚེ་ གང་ གིས་ དཔུང་ དང་ མཐུ་ ཉམས་པ ར་ བྱས་པ་ དེ འི་ ཕྱིར་ འདི་ལྟར་ ང་ ཆ་ སྟེ །_ ལྷ་ ཐམས་ཅད་ ཕམ་པ ར་ བྱ འོ །_།
en: Alas, the military strength of the asuras has been shattered by a minor class of gods! Now I shall set out and defeat all the gods!’ [39.a]

source: དེ་སྐད་ སྨྲས་ ནས །_ ལྷ་མ་ ཡིན་ གྱི་ དབང་པོ་ [39a] དེ་ ལྷ་མ་ ཡིན་ གྱི་ དབང་པོ་ ཀུན་ གྱི་ དཔུང་ བས་ ལྷག་པ ར་ བརྩོན་པ་ གང་ཡིན་པ་ དེས་ དཔོན་ སྣ་ ཐམས་ཅད་ ལ་ བསྒོ་བ་ འདི་ལྟར་ ལྷ་ གསད་པ་ དང་ །_ ལྷ་ གཞོམ་པ་ དང་ །_ ལྷ་ རྣམས་ ལ་བར་ ཆད་ བྱ་བ འི་ ཕྱིར་ བདག་ ཆ་ ཡིས་ རྔ་བོ་ ཆེ་ རྡུངས་ ཤིག་ རྡུངས་ ཤིག _།
en: $286 “At this juncture, that asura ruler will assemble an army that is even more powerful than the armies of all the other asuras and thus, calling upon all his various officers, he will proclaim, ‘I am leaving to kill, crush, and thwart all the gods! Beat the great drum! Beat it!

source: ལྷ་ དང་ བརྒྱ་བྱིན་ དུ་ བཅས་པ་ ང་ གཅིག་པུ ས་ ཐུབ་པ ར་ བྱ་ སྟེ ང་ ནི་ བདག་ བར་མ་དོ ར་ ཕམ་པ ར་ མི་ འདོད་ དོ །_།
en: I shall single-handedly bring down all the gods, including Śakra, for I will not stand for even intermittent losses!

source: གང་ ལྷ འི་ བརྩོན་འགྲུས་ དཔུང་ དང་ ལྡན་པ་ དག་ ལྷ་མ་ ཡིན་ གྱི་ བུ་མོ་ རྣམས་ ལ་ ལྟ་བ་ དང་ །_ ཉུག་པ ར་ འདོད་པ་ ཅི་ ངས་ མི་ ཤེས་ སྙམ་ མམ །_
en: Don’t you think I am aware that those eager armies of gods just want to ogle and grope our asura maidens?’

source: དེ་སྐད་ སྨྲས་ ནས་ ཐགས་ བཟངས་ རིས་ དང་ །_ རབ་དགོད་ དེ་དག་ རྔ་སྒྲ་ འབྱིན་ ཅིང་ ལྷ་མ་ ཡིན་ རྣམས་ རྒྱུགས་ ཤིག་ རྒྱུགས་ ཤིག _།
en: $287 “Vemacitrin and Overjoyed will then let drums resound as they call upon the asuras, ‘Storm ahead! Storm ahead!

source: འདི་ལྟར་ ངས་ ལྷ་ ཐམས་ཅད་ ཕམ་པ ར་ བྱ་བ་ དང་ །_ ལྷ་མ་ ཡིན་ ཐམས་ཅད་ འབྱོར་པ ར་ བྱ་བ འི་ ཕྱིར་ བདག་ཉིད་ ཆ འོ །_།
en: We are setting out to defeat all the gods and make all the asuras prosper!’

source: དེས་ དེ་སྐད་ ཅེས་ བསྒོ་ ནས་ ཤིང་རྟ་ འཁོར་ལོ་ རྩིབས་ འབུམ་ དང་ །_ ལྷ་མ་ ཡིན་ གྱི་ འོད་ ཉི་མ་ ལྟ་བུ་ བྱེ་བ་ ཕྲག་ དུ་མ་ དག་ཆ ས་ སོ །_།
en: Thus, they will strike out, riding chariots with a hundred thousand spokes and accompanied by many millions of asuras who shine like a hundred thousand suns.

source: དེ་ ཆས་པ་ དང་ །_ རི་ དང་ །_ ཆུ་བོ་ དང་ །_ རི་ ཁྲད་ཁྲོད་ དང་ །_ རི་ འོར་ དང་ །_ རི འི་ རྩེ་མོ་ དང་ །_ རི་རབ་ ཏུ་ བཅས་པ་ གཡོ་བ་ ནས་ ལེགས་ མཐོང་ གི་ ཚལ་ ན་ ལྷ་ རྣམས་ ཀྱི་ དབང་པོ་ བརྒྱ་བྱིན་ ལྷ འི་ འདུན་ས་ ཆོས་ བཟང་ ན་ འདུག་པ འི་ སྟན་ གྱི་ བར་ དུ་ གཡོ་བ་ དང་ །_
en: $288 “As the army sets out, all the mountains, rivers, mountain caves, hills, and mountain peaks, as well as Mount Sumeru itself, begin to rumble. Everything will quiver, up to and including the seat of Śakra at the Sudharma divine assembly hall within the Sudarśana park.

source: དེ་ འདི་ སྙམ་ དུ་ སེམས་ ཏེ །_།
en: At this point, Śakra will think to himself,

source: ཀྱེ་ ཨེ་མ་ བདག་ གི་ སྟན་ ཡང་ གཡོ་བ་ ལས་ ན་ གོར་མ་ཆག་ པར་ ལྷ་ དང་ ལྷ་མ་ ཡིན་ གཡུལ་འགྱེད་ པར་ འགྱུར་ ཏེ །_ ལྷ་མ་ ཡིན་ གྱི་ རྒྱལ་པོ་ ཐགས་ བཟངས་ རིས་ དེ་ ཆས་པ་ ལྟར །_ འདི་ལྟར་ ཚལ་ དང་ །_ ནགས་ཚལ་ འདི་ དང་ །_ རི་ ཁྲད་ཁྲོད་ དང་ །_ ཆུ་ ཀླུང་ དང་ །_ རི་ངོས་ དང་ བཅས་པ་ ཐམས་ཅད་ དང་ །_ རི འི་ རྒྱལ་པོ་ རི་རབ་ འདི་ ཡང་ རབ་ཏུ་གཡོ འོ །_།
en: ‘Ah, since even my own seat is trembling, there will no doubt be a war between the gods and the asuras, because whenever the asura king Vemacitrin sets out against us, these groves and forests, as well as all mountain caves, rivers, mountain slopes, and even Sumeru, the king of mountains, begin to rumble.’

source: བརྒྱ་བྱིན་ དེས་ དེ་ལྟ ར་ རིག་ ནས །_ ལྷ་ རྣམས་ ལ་ བསྒོ་བ །_
en: $289 “Having understood this, Śakra will address the gods:

source: སུམ་ཅུ་རྩ་གསུམ་པ འི་ ལྷ་ རྣམས་ ཆོས་ ཤིག་ ཆོས་ ཤིག _། འདི་ལྟར་ རབ་དགོད་ དང་ ཐགས་ བཟངས་ རིས་ དག་ ལྷ་ རྣམས་ ཕམ་པ ར་ བྱ་བ འི་ ཕྱིར་ ཆ་ ཞིང་ འདུག་ གོ །_།
en: ‘Gods of the Heaven of the Thirty-Three, get ready, get ready! Vemacitrin and Overjoyed have set out and are on their way to defeat the gods.

source: དེ འི་ ཕྱིར་ བདག་ཉིད་ ཀྱང་ འདི་ལྟར་ གླང་པོ་ཆེ་ ས་སྲུང་ གི་ བུ་ ལ་ ཞོན་ ཏེ །_ ལྷ་ ཐམས་ཅད་ དང་ ལྷན་ཅིག་ ཏུ་ ལྷ་ དང་ ལྷ་མ་ ཡིན་ གྱི་ གཡུལ་ ག་ལ་བ་ དེར་ འདོང་བ ར་ བྱ འོ །_། གང་ གི་ ཕྱིར་ རབ་དགོད་ དང་ །_ ཐགས་ བཟངས་ རིས་ ཀྱི་ གཡུལ་འགྱེད་པ་ གང་ཡིན་ པ་ དེར་ ལྷ་ འདུག་པ་ ནི་ ངས་ མ་ མཐོང་ ངོ་ །_། [39b] དེ་སྐད་ སྨྲས་པ་ དང་ །_
en: I shall therefore mount my elephant, Airāvaṇa, and ride out with all the gods to fight in that war between the gods and the asuras, because I do not see any gods involved in the war with Overjoyed and Vemacitrin.’ [39.b] $290

source: འདི་ལྟར་ ལྷ་ རྣམས་ ཀྱི་ དབང་པོ་ བརྒྱ་བྱིན་ དེ་ ནི་ དཔུང་ གི་ གཙོ་བོ་ ཡིན་ ཏེ །_ ལྷ འི་ འདུན་ས་ ཆོས་ བཟང་ དང་ །_ གྲོང་ཁྱེར་ བལྟ་ ན་ སྡུག་ ན་ གནས་པ་ རྣམས་ ལ་ ཡང་ བསྒོ །_ བཞི་མདོ་ དང་ བཞི་མདོ །_། སུམ་མདོ་ དང་ སུམ་མདོ་ དག་ ཏུ་ ཡང་ འདི་ལྟར་ ལྷ་ རྣམས་ ཀྱི་ དབང་པོ་ བརྒྱ་བྱིན་ དེ་ ནི་ ལྷ་ དང་ ལྷ་མ་ ཡིན་ གྱི་ གཡུལ་འགྱེད་ པར་ འགྲོ་ སྟེ རབ་དགོད་ དང་ ཐགས་ བཟངས་ རིས་ དག་ ག་ལ་བ་ དེ་ཉིད་ དུ་ ཐམས་ཅད་ འདོང་བ ར་ བྱ འོ་ ཞེས་ བསྒོའོ །_།
en: “In Sudharma, the assembly hall of the gods, and at crossroads and road forks throughout the city of Sudarśana, Śakra, ruler of the gods, will then, as head of the army, make an announcement: ‘Śakra, ruler of the gods, is leaving to fight in the war between the gods and the asuras. Everyone must march forth to confront Vemacitrin and Overjoyed!’

source: དེ་ནས་ དེ་དག་ ལ་ དེ་སྐད་ སྨྲས་པ་ དང་ །_ ལག་ཆ་ དང་ །_ མཚོན་ཆ་ སྣ་ཚོགས་ ཀྱི་ གནས་ སུ་ གྱུར་པ །_ ཤིང་རྟ་ སྣ་ཚོགས་ ཀྱི་ ཚལ་ དུ་ འདོང་བ ར་ བྱེད་ དེ
en: $291 “When this announcement has been made, everyone will march to Caitra­ratha­vana, the arsenal of weapons and arms.

source: མཚོན་ཆ་ ཐམས་ཅད་ ཡོད་པ་ དེར་ ལྷ་ བརྒྱ འམ །_ སྟོང་ ངམ །_ ཁྲི འམ །_ བྱེ་བ་ མཚོན་ཆ་ དོན་ དུ་ གཉེར་བ་ དེ་དག་ ཤིང་རྟ་ སྣ་ཚོགས་ ཀྱི་ ཚལ་ དུ་ འདོང་བ ར་ བྱེད་ དོ །_།
en: In this way, hundreds, thousands, hundreds of thousands, and many millions of gods will hasten to Caitra­ratha­vana to obtain weapons.

source: དེ་དག་ རྒྱུག་པ་ ན་ རྒྱ་མཚོ་ བྲུག་པ་ ལྟ་བུ འི་ སྒྲ་ བྱུང་ སྟེ །_ ལྷ་ རྣམས་ ཕན་ཚུན་ འདོང་བ་ ཤིན་ཏུ་ བརྟུལ་བ འི་ རྡུལ་ གང་ གིས་ ནམ་མཁའ་ ཡོག་པ ར་ གྱུར་པ་ རྣམ་པ་ དེ་ལྟ་ བུ་ བྱུང་ ངོ་ །_།
en: As they arrive, a clamor that sounds like a thunderstorm at sea will resound, and the dust raised by the arriving gods will blanket the sky.

source: དེ་ལྟ ར་ དེ་དག་ མཚོན་ཆ་ རྣམས་ བླངས་ ནས་ ནམ་མཁའ་ ལ་ རྒྱུ་བ་ རྣམས་ ནི་ ནམ་མཁའ་ ལ །_ སྐམ་ས་ ལ་ རྒྱུ་བ་ རྣམས་ ནི་ སྐམ་ས་ ལ །_ རི འི་ རྩེ་མོ་ ལ་ རྒྱུ་བ་ རྣམས་ ནི་ རི འི་ རྩེ་མོ་ ཀུན་ དུ་ གང་ ནས་ འདོང་ ངོ་ །_།
en: Whether they live in the sky, on dry land, or on mountaintops, masses of gods will set out from their residences to arm themselves.

source: ལྷ་ གཞན་ ཚལ་ དང་ །_ ནགས་ཚལ་ དག་ ན་ གནས་ ཤིང་ རྩེ ར་ དོང་བ འི་ ལྷ་ གང་ཡིན་པ་ དེ་དག་ ཀྱང་ རྔ་སྒྲ་ ཐོས་ ནས །_ ཤིང་རྟ་ སྣ་ཚོགས་ ཀྱི་ ཚལ་ ག་ལ་བ་ དེར་ རྒྱུག་པ ར་ བྱེད་ དོ །_།
en: Additionally, those living in groves, forests, and summits will rush to Caitra­ratha­vana upon hearing the sound of the war drum.

source: སུམ་ཅུ་རྩ་གསུམ་པ འི་ ལྷ འི་ འདོད་པ་ ཀུན་ ཀྱང་ བཏང་ ནས །_ ཐམས་ཅད་ རྒྱུག་པ ར་ བྱེད་ དོ །_། མཚོན་ཆ་ དང་ །_ ལག་ཆ་ དང་ །_ གོ་མཚོན་ རབ་ཏུ་ མང་པོ་ བརྒྱ འམ །_ སྟོང་ ངམ །_ བྱེ་བ འམ །_ བྱེ་བ་ བརྒྱ་ ཕྲག་ སྟོང་ སྙེད་ དག་ བླངས་ ནས །_
en: $292 “Putting aside all other desires, the gods of the Heaven of the Thirty-Three will thus rush forth and receive hundreds, thousands, millions, and billions of weapons, arms, and military equipment.

source: དེ་དག་ ཐམས་ཅད་ བརྒྱ་བྱིན་ ཤིན་ཏུ་ མཐོང་བ ར་ འདོད་ ཅིང་ འཁོད་ དོ །_།
en: Eager to see Śakra, they will all line up.

source: དེ་ནས་ བརྒྱ་བྱིན་ གྱིས་ དེ་དག་ གི་ ཉམས་དྲོད་ རིག་ ནས་ ལྷ་ ཐམས་ཅད་ རབ་ཏུ་ དགའ་བ ར་ བྱེད་ ཅིང་
en: When Śakra notices their commitment, this makes the gods ecstatic with joy.

source: ཤིང་རྟ་ རབ་ཏུ་ མང་པོ་ ལ་ ཞོན་ ཏེ །_ ཤིང་རྟ་ ཁ་ཅིག་ ནི་ རིན་པོ་ཆེ་ སྣ་ བདུན་ གྱིས་ བརྒྱན །_ ཁ་ཅིག་ ནི་ གསེར་ གྱིས་ བརྒྱན །_ ཁ་ཅིག་ ནི་ དངུལ་ གྱིས་ བརྒྱན །_ ཁ་ཅིག་ ནི་ བཻ་ ཌཱུརྱས་ བརྒྱན །_ ཁ་ཅིག་ ནི་ ཤེལ་ གྱིས་ བརྒྱན །_ ཁ་ཅིག་ ནི་ སྤུག་ ལ་སོགས་པ འི་ རིན་པོ་ཆེ་ ཆེན་པོ་ [40a] རྣམས་ ཀྱིས་ བརྒྱན །_
en: They will proceed to mount their numerous chariots, some of which are adorned with the seven precious substances, others with gold, others with silver, others with beryl, others with crystal, others with great gems such as musāragalva, [40.a] and others with a variety of jewels.

source: ཁ་ཅིག་ ནི་ ནོར་བུ་ སྣ་ཚོགས་ ཀྱིས་ བརྒྱན་ ཅིང་ །_ དྲིལ་བུ་ གཡེར་ཁ འི་ དྲ་བ ས་ གཏིབས་པ །_ ཀུན་ ནས་ མཛེས་པ །_ ལས་ ཀྱི་ མཆོག་ ཇི་ལྟ་བ་ བཞིན་ དུ་ ཐོབ་པ །_ རང་ གི་ གཟི་བརྗིད་ ཀྱིས་ རྟག་ ཏུ་ མཛེས་པ་ ན་ཁ་ ཅིག་ ནི་ གསེར་ གྱི་ རི་རབ་ ཀྱི་ རྩེ་མོ་ དག་ ཁྱབ་པ ར་ གནས་ སོ །_།
en: Covered with nets of bells, the chariots are beautiful, exquisitely crafted, and each adorned with its own distinctive splendor. The column of chariots extends all the way to the summits of the golden mountains.

source: བརྒྱ འམ་ སྟོང་ སྙེད་ ཁ་ཅིག་ ནི་ ནམ་མཁའ་ ལ་ དོང་ སྟེ །_
en: Arriving by the hundreds and thousands, some come soaring through the sky.

source: ལྷ འི་ དབང་པོ་ ལྷ་མ་ ཡིན་ རྣམས་ ཕམ་པ ར་ བྱ་བ འི་ ཕྱིར་ ནམ་ འགྲོ་ ཞིག་ གུ་ སྙམ་ ནས །_
en: As the gods take their places, looking attentively at Śakra, they will think,

source: བརྒྱ་བྱིན་ ལ་ ཤིན་ཏུ་ ལྟ་ ཞིང་ འཁོད་ དོ །_།
en: ‘When will the ruler of the gods set out to defeat the asuras?’

source: དེ་ལྟ ར་ ཕན་ཚུན་ ཀུན་ ནས་ གཏམ་ ཟེར་ ཞིང་ འཁོད་ དོ །_། འཐབ་པ་ ལ་ ཡིད་ ཞུགས་པ་ ཐམས་ཅད་ འཁོད་ དོ །_།
en: Conversing with one another, they all stand ready, anticipating the battle.

source: དེ་དག་ དེ་ལྟ ར་ འཁོད་པ་ དང་ །_ ལྷ འི་ དབང་པོ ས་ གླང་པོ་ཆེ འི་ ཁ་ལོ་ སྒྱུར་བ་ མ་ ཏ་ ལི་ ལ་ བསྒོ་བ །_ འདི་ལྟར་ བཟང་པོ་ སོང་ ལ་ ང འི་ གླང་པོ་ཆེ་ ས་སྲུང་ གི་ བུ་ གླང་པོ་ཆེ་ ཐམས་ཅད་ ཀྱི་ ཡོན་ཏན་ དང་ ལྡན་པ་ ཁ་ དྲུག་ ཡོད་པ་ དེ་ ལ་ ཞོན་ ནས་ ངས་ ལྷ་མ་ ཡིན་ རྣམས་ ཕམ་པ ར་ བྱ འོ་
en: $293 “At this point Śakra, ruler of the gods, will instruct his elephant driver Mātali, ‘Be so good as to go tell my elephant, Airāvaṇa, the six-headed one possessing all the good qualities of elephants, that I wish to ride him and thus defeat the asuras.’

source: ཞེས་ སྒོ་ ཤིག _། དེ་ནས་ མ་ ཏ་ ལི ས་ བརྒྱ་བྱིན་ གྱི་ བཀའ་ མནོས་ ནས །_ རང་ གི་ འདོད་པ ས་ སྤྲུལ་པ འི་ པད་མ འི་ ཚལ་ ན་ གླང་པོ་ཆེ་ ས་སྲུང་ གི་ བུ་ གླང་པོ་ཆེ་ མང་པོ ས་ ཡོངས་སུ་ བསྐོར་བ་ ག་ལ་བ་ དེར་ སོང་ ངོ་ །_།
en: $294 “Following Śakra’s instruction, Mātali will then go before the elephant Airāvaṇa, who will be enjoying himself in a lotus grove surrounded by a great herd of elephants.

source: དེ་ནས་ གླང་པོ་ཆེ་ ཅང་ཤེས་ དེ་ ལ་ འདི་སྐད་ སྨྲས་ སོ །_།
en: There Mātali will say to that thoroughbred elephant,

source: འདི་ལྟར་ ལྷ འི་ དབང་པོ་ བརྒྱ་བྱིན་ དེ་ ཁྱོད་ ལ་ འབོད་ དེ །_ ལྷ་མ་ ཡིན་ གྱི་ གཡུལ་ དུ་ ཁྱོད་ ལ་ ཞོན་ ནས་ ལྷ་མ་ ཡིན་ རྣམས་ ཕམ་པ ར་ བྱ འོ་ ཞེས་ གསུང་ ངོ་ །_།
en: ‘Śakra, ruler of the gods, is summoning you. He wishes to ride you and defeat the asuras.’

source: དེ་ནས་ གླང་པོ་ཆེ་ ས་སྲུང་ གི་ བུ་ མ་ ཏ་ ལི་ ག་ལ་བ་ དེར་ སོང་ སྟེ་ ཕྱིན་ ནས །_ ལྷ འི་ འདུན་ས་ ཆོས་ བཟང་ ག་ལ་བ་ དེར་ སོང་ ངོ་ །_།
en: $295 “The elephant Airāvaṇa will then stride toward Mātali and proceed to Sudharma, the assembly hall of the gods.

source: དེར་ འོངས་པ་ དང་ མ་ ཏ་ ལི ས་ བརྒྱ་བྱིན་ ལ་ སྨྲས་པ །_
en: When they arrive there, Mātali will say to Śakra,

source: ལྷ འི་ དབང་པོ་ འདི་ལྟར་ གླང་པོ་ཆེ འི་ མཆོག་ དེ་ མཆིས་ སོ །_།
en: ‘Ruler of the gods, your supreme elephant has arrived.’

source: བརྒྱ་བྱིན་ གྱི་ རྫུ་འཕྲུལ་ གྱིས་ དེ འི་ ལུས་ དེ་ ལ་ཁ་ སྐྱོན་མེད་པ་ བརྒྱ་ སྤྲུལ་པ ར་ བྱེད་ དེ །_ ཁ་ རེ་རེ་ ལ་སོ་ དཀར་པོ་ བཅུ་ བཅུ །_
en: $296 “With his magical powers, Śakra will now make one hundred flawless heads appear on the body of the elephant, each of them bearing ten white tusks.

source: སོ་ རེ་རེ་ ལ་ པད་མ འི་ རྫིང་བུ་ བཅུ་ བཅུ །_ པད་མ འི་ རྫིང་བུ་ རེ་རེ་ ལ་ པད་མ་ སྟོང་ སྟོང་ །_
en: On each of the tusks lie ten lotus pools, each of them containing one thousand lotuses.

source: པད་མ་ རེ་རེ་ ལ་ རི་བོ་ བཅུ་ བཅུ །_ རི་བོ་ རེ་རེ་ ལ་ པོག་རི་ བརྒྱ་ བརྒྱ །_
en: Each of the lotuses supports ten mountains, each one of those capped by a hundred peaks.

source: པོག་རི་ རེ་རེ་ ལ་ ལྷ་མོ་ བརྒྱ་ བརྒྱ །_ སིལ་སྙན་ ཡན་ལག་ ལྔ་ དང་ ལྡན་པ ས་ གླུ་ ལེན་ བྲོ་ རྡུང་ ཞིང་ །_ ཤིན་ཏུ་ ཆགས་ སུ་ རུང་བ་ གཞན་ དང་ མི་ འདྲ་བ འི་ གླུ་དབྱངས་ དང་ ཡང་དག་ པར་ ལྡན་ [40b] པ་ དག་ ལེན་ ཏེ
en: Upon each peak stand a hundred goddesses, who play the five classes of instruments, sing, dance, and perform, in an exceedingly gorgeous and truly exceptional fashion. [40.b]

source: དེ་ལྟ ར་ གླང་པོ འི་ མཆོག་ ས་སྲུང་ གི་ བུ་ ལ་ ལྷ འི་ དབང་པོ་ བརྒྱ་བྱིན་ སྤྲུལ་པ་ བྱེད་ དོ །_།
en: Such is the magical creation that Śakra, ruler of the gods, conjures upon his supreme elephant, Airāvaṇa.

source: གླང་པོ་ཆེ འི་ དབང་པོ་ དེ་ཡང་ ལུས་ ཀུན་ ནས་ དཔག་ཚད་ སྟོང་ ཡོད་ དོ །_། ལྷ འི་ དབང་པོ་ བརྒྱ་བྱིན་ ལྷ་མ་ ཡིན་ རྣམས་ ཕམ་པ ར་ བྱ་བ འི་ ཕྱིར་ སིལ་སྙན་ དང་ །_ རོལ་མོ འི་ སྒྲ་ དང་ །_ གླུ་ དང་ །_ ཅ་ཅོ་ དང་ །_ ག་ཞ འི་ སྒྲ་དབྱངས་ འབྱིན་པ་ རྣམས་ ཀྱིས་ རྣམ་པར་ མཛེས་པ་ ན་ ཀུན་ ནས་ རྣམ་པ་ དེ་ལྟ་ བུ་ དང་ ལྡན་པ འི་ གླང་པོ་ཆེ་ མཆོག་དཀར་པོ་ དེ་ ལ་ ཞོན་ ནོ །_།
en: $297 “The body of this elephant measures a thousand leagues, and when Śakra, ruler of the gods, rides this supreme and beautiful white elephant to defeat the asuras, it is to the delightful accompaniment of the sounds of instruments, melodious songs, sweet noises, and playful antics.

source: དེ་ནས་ དེ་ འགྲོ་བ་ མངོན་པར་ མཐོང་ ནས །_ ལྷ་ རྣམས་ ཀྱང་ ཤིང་རྟ་ ཁ་དོག་ རྣམ་པ་ སྣ་ཚོགས་ ལ་ ཞོན་ ཏེ །_ མཚོན་ཆ་ སྣ་ཚོགས་ ནི་ ཐོགས །_ ལུས་ ལ་ རྒྱན་ སྣ་ཚོགས་ ནི་ བཏགས །_ དགོད་པ་ དང་ །_ རྩེ་བ་ དང་ །_ སྒྲ་ དི་ རི་ རི་ འདོན་པ་ དང་ །_ རབ་ཏུ་ དགའ་བ འི་ ཡིད་ རྣམ་པ་ དུ་མ་ ཕྱིར་ཞིང་ ཡིད་ རབ་ཏུ་ དགའ་བ ར་ གྱུར་ ཏོ །_།
en: When they see him coming, the gods will mount their multicolored chariots, brandish their weapons, and adorn their bodies with various ornaments while they laugh and joke excitedly in a state of tremendous joy and exultation.

source: དེ་ནས་ ལྷ འི་ དབང་པོ་ བརྒྱ་བྱིན་ དབུས་ ཀྱི་ སྟན་ ལ་ འདུག་ སྟེ །_ བསོད་ནམས་ ཀྱི་ སྟོབས་ཆེན་པོ་ དང་ ནི་ ལྡན །_ ལྷ འི་ མཆོག་ མང་པོ ས་ ནི་ ཡོངས་སུ་ བསྐོར །_ གཞན་ དང་ མི་ འདྲ་བ ར་ ནི་ བརྗིད །_ ལྷ་ རྣམ་པ་ སྣ་ཚོགས་ ཀྱིས་ ནི་ ཡོངས་སུ་ བསྐོར་ ཏེ །_ སུམ་ཅུ་རྩ་གསུམ་པ འི་ བདག་པོ་ ཉི་མ་ འབུམ་ བས་ ལྷག་པ འི་ འོད་ ཀྱིས་ ནམ་མཁའ་ འགེངས་ ཤིང་ །_
en: $298 “Residing upon his seat, the ruler of the Heaven of the Thirty-Three is endowed with great powers of merit. Surrounded by many supreme gods, he displays an unrivaled splendor. In this fashion, encircled by numerous gods, the lord of the Heaven of the Thirty-Three now fills the sky with a light that is brighter than a hundred thousand suns.

source: སིལ་སྙན་ དང་ །_ གླུ་དབྱངས་ རྣམ་པ་ སྣ་ཚོགས་ ཀྱིས་ འགེངས་པ་ ན །_ ནམ་མཁ འི་ དཔག་ཚད་ ཉི་ཁྲི ར་ བཀང་ ནས་ ལྷ་ དང་ ལྷ་མ་ ཡིན་ གྱི་ གཡུལ་ ག་ལ་བ་ དེར་ འཇུག་པ ར་ བྱེད་ དོ །_།
en: Then, as beautiful songs resound across a span of twenty thousand leagues, he launches into the war between the gods and the asuras.
